tests-results/results-Artillery/result.txt
Phase started: unnamed (index: 0, duration: 1s) 23:31:22(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:31:23(-0300)

--------------------------------------
Metrics for period to: 23:31:30(-0300) (width: 7.922s)
--------------------------------------

http.codes.200: ................................................................ 407
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 427
http.response_time:
  min: ......................................................................... 53
  max: ......................................................................... 460
  median: ...................................................................... 376.2
  p95: ......................................................................... 391.6
  p99: ......................................................................... 399.5
http.responses: ................................................................ 407
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 23:31:40(-0300) (width: 9.982s)
--------------------------------------

http.codes.200: ................................................................ 506
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 504
http.response_time:
  min: ......................................................................... 368
  max: ......................................................................... 431
  median: ...................................................................... 391.6
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2
http.responses: ................................................................ 506
vusers.completed: .............................................................. 2
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 17545.3
  max: ......................................................................... 17628.7
  median: ...................................................................... 17505.6
  p95: ......................................................................... 17505.6
  p99: ......................................................................... 17505.6


--------------------------------------
Metrics for period to: 23:31:50(-0300) (width: 1.687s)
--------------------------------------

http.codes.200: ................................................................ 87
http.request_rate: ............................................................. 44/sec
http.requests: ................................................................. 69
http.response_time:
  min: ......................................................................... 105
  max: ......................................................................... 378
  median: ...................................................................... 308
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.responses: ................................................................ 87
vusers.completed: .............................................................. 18
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 17939
  max: ......................................................................... 18879.1
  median: ...................................................................... 18588.1
  p95: ......................................................................... 18963.6
  p99: ......................................................................... 18963.6


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:31:43(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 49/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 53
  max: ......................................................................... 460
  median: ...................................................................... 383.8
  p95: ......................................................................... 415.8
  p99: ......................................................................... 424.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 17545.3
  max: ......................................................................... 18879.1
  median: ...................................................................... 18588.1
  p95: ......................................................................... 18963.6
  p99: ......................................................................... 18963.6