tests-results/results-Artillery/result_console.txt
Phase started: unnamed (index: 0, duration: 1s) 23:26:16(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:26:17(-0300)

--------------------------------------
Metrics for period to: 23:26:20(-0300) (width: 3.909s)
--------------------------------------

http.codes.200: ................................................................ 188
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 208
http.response_time:
  min: ......................................................................... 47
  max: ......................................................................... 548
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 432.7
http.responses: ................................................................ 188
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 23:26:30(-0300) (width: 9.983s)
--------------------------------------

http.codes.200: ................................................................ 496
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 496
http.response_time:
  min: ......................................................................... 382
  max: ......................................................................... 456
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 432.7
http.responses: ................................................................ 496


--------------------------------------
Metrics for period to: 23:26:40(-0300) (width: 6.326s)
--------------------------------------

http.codes.200: ................................................................ 316
http.request_rate: ............................................................. 48/sec
http.requests: ................................................................. 296
http.response_time:
  min: ......................................................................... 98
  max: ......................................................................... 455
  median: ...................................................................... 391.6
  p95: ......................................................................... 432.7
  p99: ......................................................................... 450.4
http.responses: ................................................................ 316
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18109.9
  max: ......................................................................... 19469.1
  median: ...................................................................... 19346.7
  p95: ......................................................................... 19346.7
  p99: ......................................................................... 19346.7


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:26:37(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 47
  max: ......................................................................... 548
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 450.4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18109.9
  max: ......................................................................... 19469.1
  median: ...................................................................... 19346.7
  p95: ......................................................................... 19346.7
  p99: ......................................................................... 19346.7